:PROPERTIES:
:ID:       b987ce8b-c42f-4de2-83c4-350be3cf5de1
:END:
#+TITLE: GNUPG
#+DESCRIPTION:
#+TAGS:
**** Preset Passphrase in GPG

Here's what =preset_passphrase= does:

#+begin_src sh :output verbatim
gpg-connect-agent "help preset_passphrase" /bye | head -n-1
#+end_src

#+RESULTS:
: # PRESET_PASSPHRASE [--inquire] <string_or_keygrip> <timeout> [<hexstring>]
: #
: # Set the cached passphrase/PIN for the key identified by the keygrip
: # to passwd for the given time, where -1 means infinite and 0 means
: # the default (currently only a timeout of -1 is allowed, which means
: # to never expire it).  If passwd is not provided, ask for it via the
: # pinentry module unless --inquire is passed in which case the passphrase
: # is retrieved from the client via a server inquire.

I think the =gpg-preset-passphrase= tool is required for this to work, but the
executable is missing for me on both arch & guix.

#+begin_src sh :eval no

#+end_src

Otherwise, this should work, but is still returning =Err 67108933 not implemented <GPG Agent>=:

#+begin_src sh :eval no
# get $keygrip
shroudpass=$(shroud show $identity $keysha)
gpg-connect-agent "preset_passphrase $keygrip 0 $shroudpass" /bye
#+end_src

*** Utility Functions

hmmmm ... =almost-surely-most-positive-fixnum=?

#+begin_src emacs-lisp
(format "%X" (* 1 most-positive-fixnum))         ;"1FFFFFFFFFFFFFFF"
(format "%X" (* 2 most-positive-fixnum))         ;"3FFFFFFFFFFFFFFE"
(format "%X" (* 4 most-positive-fixnum))         ;"7FFFFFFFFFFFFFFC"
(format "%X" (* 8 most-positive-fixnum))         ;"FFFFFFFFFFFFFFF8"
(format "%X" (* 16 most-positive-fixnum))       ;"1FFFFFFFFFFFFFFF0"
(format "%X" (+ 1 (* 16 most-positive-fixnum))) ;"1FFFFFFFFFFFFFFF1"
#+end_src

Well =integer-width= is set to =65536=. That's interesting.

Generate octal or other formats

#+begin_src emacs-lisp
(defun rand-formatted (format &optional nchars)
  (if-let* ((nbits (or (and (equal format "o") 3)
                       (and (equal format "X") 4)))
            (nmax (or (and nchars
                           (expt 2 (* nbits nchars)))
                      (* 2 most-positive-fixnum)))
            (nrand (random nmax)))
      (progn
        (message "%s %s %s" nbits nmax nrand)
        ;; nrand
        (format (concat "%" format) nrand))
    (user-error "something not right")))
#+end_src

Generate MD5 Hex

#+begin_src emacs-lisp
(let* ((hash-str (reverse "fdab123ce"))
       (nchars (length hash-string)))
  (cl-loop for i from 1 to (- (length hash-str) 1)
           iter-by 2
           thereis (< (- nchars i) 2)
           collect))
#+end_src

#+RESULTS:

 ... or not

#+begin_quote
i could write this in clojure in like 5 seconds ... does cl-reduce give you the
index? well it doesn't allow you to really accumulate.
#+end_quote

So =hexdump= it is ... i forgot about that and didn't realize it has plenty of
[[https://stackoverflow.com/questions/34328759/how-to-get-a-random-string-of-32-hexadecimal-digits-through-command-line][formatting options]]. Thanks command line.

#+begin_src sh :results verbatim
bytes=32
chunk_bytes=2
chunks="$(($bytes/$chunk_bytes))"

# for hex, luckily octal doesn't need to be interpolated
hd_hex_formatter="%0$((2 * chunk_bytes))X"
hd_expr="$((chunks - 1))/$chunk_bytes \"$hd_hex_formatter:\""
hd_expr="$hd_expr 1/$chunk_bytes \"$hd_hex_formatter \n\""

echo $hd_expr
hexdump -vn"$bytes" -e "$hd_expr" /dev/urandom
#+end_src

#+RESULTS:
: 15/2 "%04X:" 1/2 "%04X \n"
: 693A:02C4:757A:2E97:6D02:0DA2:BCBD:0332:0D32:681A:5677:19B8:173B:4F1E:27F9:2D53

**** Help on KEYINFO commands

#+begin_src sh :results verbatim :exports both
gpg-connect-agent "help KEYINFO" /bye
#+end_src

#+RESULTS:
#+begin_example
# KEYINFO [--[ssh-]list] [--data] [--ssh-fpr[=algo]] [--with-ssh] <keygrip>
#
# Return information about the key specified by the KEYGRIP.  If the
# key is not available GPG_ERR_NOT_FOUND is returned.  If the option
# --list is given the keygrip is ignored and information about all
# available keys are returned.  If --ssh-list is given information
# about all keys listed in the sshcontrol are returned.  With --with-ssh
# information from sshcontrol is always added to the info. Unless --data
# is given, the information is returned as a status line using the format:
#
#   KEYINFO <keygrip> <type> <serialno> <idstr> <cached> <protection> <fpr>
#
# KEYGRIP is the keygrip.
#
# TYPE is describes the type of the key:
#     'D' - Regular key stored on disk,
#     'T' - Key is stored on a smartcard (token),
#     'X' - Unknown type,
#     '-' - Key is missing.
#
# SERIALNO is an ASCII string with the serial number of the
#          smartcard.  If the serial number is not known a single
#          dash '-' is used instead.
#
# IDSTR is the IDSTR used to distinguish keys on a smartcard.  If it
#       is not known a dash is used instead.
#
# CACHED is 1 if the passphrase for the key was found in the key cache.
#        If not, a '-' is used instead.
#
# PROTECTION describes the key protection type:
#     'P' - The key is protected with a passphrase,
#     'C' - The key is not protected,
#     '-' - Unknown protection.
#
# FPR returns the formatted ssh-style fingerprint of the key.  It is only
#     printed if the option --ssh-fpr has been used.  If ALGO is not given
#     to that option the default ssh fingerprint algo is used.  Without the
#     option a '-' is printed.
#
# TTL is the TTL in seconds for that key or '-' if n/a.
#
# FLAGS is a word consisting of one-letter flags:
#       'D' - The key has been disabled,
#       'S' - The key is listed in sshcontrol (requires --with-ssh),
#       'c' - Use of the key needs to be confirmed,
#       '-' - No flags given.
#
# More information may be added in the future.
OK
#+end_example
